-- إعدادات مظهر شريط القوائم والـ Dock
shell = {
    panel = {
        transparency = "glass",       -- تفعيل نمط الزجاج
        opacity = 0.45,               -- درجة شفافية خفيفة جداً مثل الماك (بين 0.40 و 0.50)
        borders = true,               -- تفعيل الحدود الخارجية
        border_opacity = 0.15,        -- حدود خفيفة جداً تعطي إيحاء ببروز الزجاج
        border_color = "#ffffff",     -- لون الحد أبيض ليعكس الإضاءة
        corner_radius = 12,           -- حواف دائرية ناعمة تحاكي الـ Dock في الماك
    }
}
